<template>
    <section class="containerDialog">
        <el-dialog ref="dialogHeight" title="" :visible.sync="dialogTableVisible" :close-on-click-modal="false">
            <div class="textDiv" v-html="textarea" :style="textDivHeight"></div>
            <div slot="footer" class="dialog-footer">
                <el-button @click="dialogQxBtn" :disabled="disabled" size="small">
                    <span>{{count}}</span><span>{{timeStr}}</span>关闭
                </el-button>
            </div>
        </el-dialog>
    </section>
</template>

<script>
    export default {
        name: 'register',
        components: {},
        data() {
            return {
                textDivHeight:{
                    height:""
                },
                dialogTableVisible:false,
                count: '',
                timer: null,
                timeStr:"S ",
                disabled:true,
                textarea:
                `<h2>中国电子科技集团电子采购平台用户协议</h2>
                <h3>一、总则 </h3>
                <ul>
                    <li>1.1 中国电子科技集团电子采购平台（https://www.sdicc.com.cn）（以下简称“采购平台”）是由北京筑龙信息技术有限责任公司委托中投咨询有限公司出资建设，供北京筑龙信息技术有限责任公司总部、子公司、控股投资企业实施电子采购的统一对外电子采购门户。采购平台由国家开发投资集团有限委托中投咨询有限公司（以下简称“运营方”）负责运营、维护，用户与采购平台之间的争议处理由运营方负责。</li>
                    <li>1.2 用户在使用本采购平台提供的服务前务必认真阅读本协议，一旦用户使用本平台提供的服务即表示用户同意与本平台签订本协议且同意受本协议及各项相关规则之约束。本协议用于规范运营方与采购平台用户之间的行为及关系，包括协议正文及所有采购平台已经发布的或将来可能发布的各类规则。所有规则为协议不可分割的一部分，与协议正文具有同等法律效力。本条款所称的用户是指完全同意本协议所有条款并完成注册程序的采购平台使用者。</li>
                    <li>1.3 采购平台有权利根据需要调整协议的条款。如本协议有任何变更，运营方将通过采购平台门户网站刊载公告的方式通知用户，用户理解并同意运营方不再另行发布其他形式的通知。用户对新修改的条款如有异议，在履行完未完成的责任义务后可停止使用采购平台提供的服务，并申请退出采购平台。继续使用采购平台提供的服务表明用户理解并同意修订的条款。当用户与采购平台发生争议时，解决争议时应以最新的服务协议为准。除另行明确声明外，采购平台任何扩大服务范围或增强功能的新内容均受本协议约束。</li>
                    <li>1.4 用户确认：在同意接受本协议并注册成为采购平台用户时，具有法律规定的完全民事权利能力和民事行为能力，为能够独立承担民事责任的法人或其他组织；本协议内容不受其所属国家或地区的排斥。不具备前述条件的，应立即终止注册或停止使用本服务。采购平台暂不接受自然人注册。
                        <p>请特别注意：</p>
                        <p>（1）如果用户对本协议的任何条款有异议，可选择不注册为本采购平台的用户。只要点击协议正本下方的“我同意”按钮并按照采购平台注册程序成功注册为用户，该行为即表示同意签署本协议并受本协议及后续平台发布各类规则约束；</p>
                        <p>（2）本协议不涉及注册用户之间因使用采购平台撮合交易而产生的法律关系及法律纠纷；</p>
                        <p>（3）采购平台仅作为信息提供平台，不作为任何采购关系权利义务主体，不介入注册用户之间的纠纷。采购平台各用户利用采购平台参与相关的电子采购活动，必须对各自的行为承担相应法律责任。</p>
                    </li>
                </ul>
                <h3>二、采购平台服务内容 </h3>
                <ul>
                    <li>2.1 本采购平台提供的服务主要包括招标、询比采购、竞争性谈判、单一来源采购、竞价等多种采购形式。具体内容由本采购平台根据实际情况提供，并以实际可用的服务为准。运营方有权在必要时变更采购平台的相关规定及服务内容，并保留随时变更、中断或终止采购平台的权利，尽可能通过在本采购平台门户网站上刊登公告的方式通知注册用户。</li>
                    <li>2.2 本采购平台在提供服务时，会明确告知用户需缴纳的相应服务费用。如用户拒绝支付该项费用，将无法获得相关的服务。</li>
                    <li>2.3 用户理解：本采购平台仅作为用户物色交易对象，就工程、货物和服务的交易进行协商，以及获取各类与贸易相关的服务的虚拟场所。采购平台不能控制交易所涉及的工程、货物、服务的质量、安全或合法性，商贸信息的真实性或准确性，以及交易方履行其在贸易协议项下的各项义务的能力。用户使用采购平台所需的相关网络服务设备（如电脑、调制解调器及其他与接入互联网有关的装置）及费用（如为接入互联网而支付的电话费及上网费）均应由用户自行负担。为保证所使用网络服务的通畅有效，用户应确保所使用网络连接的高速顺畅。</li>
                    <li>2.4 用户对本协议的同意或确认，即表示对本采购平台所提供功能和服务表示认可。 </li>
                </ul>
                <h3>三、用户使用规则</h3>
                <ul>
                    <li>3.1 用户在申请使用本采购平台服务时，必须按照采购平台要求和提示，准确提供企业及个人资料。倘若提供任何不真实、不准确、不完整或不能反映当前情况的资料，或本采购平台有合理理由怀疑资料不真实、不准确、不完整或不能反映当前情况，本采购平台有权暂停或终止该用户的注册身份及资料，并驳回其在目前或将来对“服务”(或其任何部分) 以任何形式使用。用户对其在采购平台提供信息的真实性、准确性和及时性负责，如有提供信息不实等任何违反前述规定的情况，本采购平台有权依法追究用户由此对采购平台及相关用户造成损失的责任。</li>
                    <li>3.2 用户有权利使用自己的用户名及密码随时登录采购平台，须自行负责注册名和密码的保密，且须对在该注册名和密码下发生的所有活动承担责任。本采购平台不能也不会对因其未能遵守本款规定而发生的任何损失或损毁负责。未经本采购平台书面许可，用户不得将其用户名、密码转售、赠与、转借、租借给第三方或用于商业性用途。否则，由此造成的一切后果和责任由用户自行承担；同时，本采购平台有权单方面终止为其提供服务。</li>
                    <li>3.3 用户必须同意遵循以下原则，并承担责任：(a) 遵守中华人民共和国有关的法律和法规；(b) 不得为任何非法目的而使用采购平台服务；(c) 遵守本采购平台所有与服务有关的协议、规定和程序，并接受本采购平台对用户的管理；(d) 不得利用本采购平台进行任何可能对互联网的正常运转造成不利影响的行为；(e) 不得利用本采购平台传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；(f) 不得利用本采购平台进行任何不利于本采购平台的行为；(g) 如发现任何非法使用用户名或用户出现安全漏洞的情况，应立即通告本采购平台；（h）使用采购平台进行交易过程中应遵守诚实信用的原则，不在交易过程中采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为；(i)不对采购平台上任何数据作商业性利用，包括但不限于在未经采购平台事先书面批准的情况下，以复制、传播等方式使用在采购平台上展示的任何资料。</li>
                </ul>
                <h3>四、服务升级、中断或终止 </h3>
                <ul>
                    <li>4.1 如因系统维护或升级的需要而需暂停服务，本采购平台将事先在网上进行通告。</li> 
                    <li>4.2 如用户向采购平台提出注销采购平台注册用户身份时，经采购平台审核同意，由采购平台注销该注册用户，该用户即解除与采购平台的协议关系。但注销该用户账号后，采购平台仍保留下列权利：(a)注销后，采购平台有权保留其注册数据及以前的交易行为记录；(b)注销后，如其在注销前在采购平台上存在违法行为或违反合同的行为，采购平台仍可行使本协议所规定的权利。</li>
                    <li>4.3 在下列情况下，采购平台可以通过注销用户的方式终止服务：(a)在用户违反本协议相关规定时，采购平台有权终止向其提供服务。采购平台将在中断服务时通知该用户。但如其在被采购平台终止提供服务后，再一次直接或间接或以他人名义注册为采购平台用户时，采购平台有权再次单方面终止向其提供服务；(b)一旦采购平台发现用户的注册数据中主要内容是虚假的，采购平台有权随时终止向其提供服务；(c)本协议终止或更新时，用户明示不愿接受新的协议的；(d) 若用户通过网络、短信或热线电话等方式恶意辱骂、骚扰、攻击工作人员时，采购平台有权随时终止向其提供服务；(e)其它采购平台认为需终止服务的情况。</li>
                    <li>4.4 除前款所述情形外，本采购平台同时保留在事先通知用户的情况下随时中断或终止部分或全部服务的权利，如果用户对上述行为持有异议，可通过本协议约定的方式停止使用相关服务。对于所有服务的中断或终止而造成的任何损失，本采购平台无需对用户或任何第三方承担任何责任。</li>
                </ul>
                <h3>五、免责及赔偿</h3>
                <ul>
                    <li>5.1 运营方有责任维护好采购平台的正常运行，但在用户使用服务时，如因不可抗力、计算机病毒或者黑客攻击、系统不稳定、设备故障、数据传输、软件瑕疵、系统升级、设备检修或维护等原因造成服务中断或不能满足用户要求，运营方不承担任何责任。</li>
                    <li>5.2 因上述事故造成交易通讯中断或交易数据失真，恢复交易时以故障发生前采购平台主机最终记录的交易数据为有效数据。</li>
                    <li>5.3 采购平台对服务之及时性、安全性、全面性和准确性不作特别担保，平台用户对自行发布的数据信息的准确性承担责任和后果，采购平台不承担任何形式的连带责任。</li>
                    <li>5.4 用户使用本采购平台服务所存在的风险及可能造成的损失将完全由其自己承担；因其使用本采购平台服务而产生的一切后果也由其自己承担，本采购平台无需对用户或任何第三方承担任何责任。如用户导致采购平台遭受任何损害或遭受任何来自第三方的纠纷、诉讼和索赔要求等，用户须向采购平台赔偿相应损失，并需要对其违反本协议所产生的一切后果负全部法律责任，包括但不限于全部直接和间接损失及因索赔导致的诉讼费、仲裁费和律师费等。</li>
                </ul>
                <h3>六、知识产权</h3> 
                <ul>
                    <li>6.1 采购平台上所有内容，包括但不限于文字、图片、网站架构、网站画面的安排、网页设计，均由中投咨询有限公司依法拥有其知识产权及其他合法权利，包括但不限于商标权、专利权、著作权、商业秘密等。</li>
                    <li>6.2 用户不得侵犯第6.1条本采购平台所享有的知识产权和其他合法权利，包括但不限于只有在获得本采购平台或其他相关权利人的授权之后才能使用这些内容，不能以擅自复制、再造、传播等方式使用这些内容、或创造与内容有关的派生产品。</li>
                    <li>6.3 未经本采购平台书面许可，用户不得利用本采购平台所获得的信息用于商业用途，如发现用户与本采购平台形成竞争或损害本采购平台的利益，或本采购平台认为对其正常运营可能造成损害的其他行为，本采购平台有权单方面终止其使用资格，由此造成的一切后果和责任由用户承担。</li>
                </ul>
                <h3>七、信息批露 </h3>
                <ul>
                    <li>7.1 用户授予本采购平台运营方及北京筑龙信息技术有限责任公司总部、子公司、控股投资企业合理地使用其信息的权利。本采购平台承诺，其在采购过程中来往的所有文件将不会被恶意泄露。</li>
                    <li>7.2 在使用采购平台进行网上物色交易对象时，用户不可避免的要向交易对方或潜在的交易对方提供自己的信息。请用户妥善保护相关信息，仅在必要的情形下向他人提供。如果用户发现信息泄密，尤其是采购平台账户及密码发生泄露，应立即联络采购平台管理员，以便采取相应措施。</li>
                    <li>7.3 用户信息将在下述情况下按最低限度被采购平台披露：(a)经用户同意，向第三方披露；(b)根据法律的有关规定，或者行政或司法机构的要求披露；(c)如果用户出现违反中华人民共和国有关法律或者采购平台公布的政策规范的情况，需要向第三方披露；(d)为提供用户所要求的产品和服务，而必须和第三方分享；(e)其它采购平台根据法律认为合适的披露。</li>
                    <li>7.4 网络环境存在诸多不可预知因素，如用户使用采购平台时被第三方抓取甚至泄露信息，只要采购平台并未主动或故意泄露用户隐私，则由用户自行承担风险，运营方不承担任何责任。</li>
                </ul>
                <h3>八、附则</h3> 
                <ul>
                    <li>8.1 本协议书在用户确认并注册成功后即自动生效，用户确认在每次使用平台前已充分理解并知悉本协议及平台后续发布的各类规则，并承诺一经使用即受上述规定的约束。</li>
                    <li>8.2 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。用户与采购平台之间发生的任何争议，双方均应本着诚实守信、公平合理的原则友好协商解决。如果双方未能就有关争议达成一致意见，双方约定任何一方应向本采购平台所在地法院提起诉讼。</li>
                    <li>8.3 本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</li> 
                    <li>8.4 本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。</li>
                    <li>8.5 本协议由运营方解释及修订。</li>
                </ul>`
            }
        },
        methods: {
            dialogQxBtn() {
                this.dialogTableVisible = false
            },
            qyBoolen() {    
                this.dialogTableVisible = true
                this.getCode()

                this.$nextTick(() => { //使用nextTick为了保证dom元素都已经渲染完毕
                    this.setHeight()
                });
            },
            //获取关闭倒计时
            getCode() {
                this.timeStr='S '

                const num = 10;
                if (!this.timer) {
                    this.count = num;
                    this.disabled = true;
                    this.timer = setInterval(() => {
                        if (this.count > 0 && this.count <= num) {
                            this.count--;
                        } else {
                            this.timeStr=null
                            this.disabled = false;
                            clearInterval(this.timer);
                            this.timer = null;
                            this.count=null
                        }
                    }, 1000);
                }
            },
            //动态设置文本高度
            setHeight(){
                let height = this.$refs.dialogHeight.$el.firstChild.offsetHeight; //100
                this.textDivHeight.height= (height - 110)+ "px"
            }
        },
        create() {
        },
        mounted() {
            window.onresize = () => {
                return (() => {
                    this.setHeight()
                })();
            };
        },
        destroyed() { },
        watch: {
        },
    }

</script>

<style lang="scss" scoped>
    .containerDialog {
         ::v-deep.el-dialog {
            width: 1200px!important;
            height: calc(100% - 60px)!important;
            margin:30px auto!important;
            .el-dialog__header {
                display:none;
               
            }
            .el-dialog__body {
                .textDiv{
                    overflow:auto;
                    color:#333;
                    font-size:14px;
                    font-weight:500;
                    padding: 0 40px;
                    h2{
                        font-size:22px;
                        text-align:center;
                        font-weight:900;
                    }
                    h3{
                        font-size:16px;
                        font-weight:500;
                        color: #000000;
                        padding: 10px 0;
                        letter-spacing:1px

                    }
                    ul {
                        li {
                            font-size: 16px;
                            letter-spacing:2px
                        }
                        p {
                            font-size: 16px;
                            letter-spacing:2px
                        }
                    }
                }
                padding-bottom: 10px;
            }
            .dialog-footer{
                text-align: center;
                .el-button{
                    width:100px;
                    height:40px;
                    padding:0;
                    span{
                        font-size:16px;
                        color:#f00;
                        span{
                            font-size:16px;
                            color:#333;
                        }
                    }
                }
            }
        }
    }
</style>