export default {
  shenZhen: [
    {
      code: '1A',
      text: '深圳市交易集团有限公司'
    },
    {
      code: '1B',
      text: '深圳市投资控股有限公司'
    },
    {
      code: '1C',
      text: '深业集团有限公司'
    },
    {
      code: '1D',
      text: '深圳市地铁集团有限公司'
    },
    {
      code: '1E',
      text: '深圳市机场（集团）有限公司'
    },
    {
      code: '1F',
      text: '深圳市盐田港集团有限公司'
    },
    {
      code: '1G',
      text: '深圳能源集团股份有限公司'
    },
    {
      code: '1H',
      text: '深圳市水务（集团）有限公司'
    },
    {
      code: '1I',
      text: '深圳市燃气集团股份有限公司'
    },
    {
      code: '1J',
      text: '深圳巴士集团股份有限公司'
    },
    {
      code: '1K',
      text: '深圳市深粮控股股份有限公司'
    },
    {
      code: '1L',
      text: '深圳市农产品股份有限公司'
    },
    {
      code: '1M',
      text: '深圳市特区建设发展集团有限公司'
    },
    {
      code: '1N',
      text: '深圳市创新投资集团有限公司'
    },
    {
      code: '1O',
      text: '深圳国际控股有限公司'
    },
    {
      code: '1P',
      text: '深圳市城市公共安全技术研究院有限公司'
    },
    {
      code: '1Q',
      text: '深圳市人才安居集团有限公司'
    },
    {
      code: '1R',
      text: '深圳市赛格集团有限公司'
    },
    {
      code: '1S',
      text: '深圳市国有免税商品（集团）有限公司'
    },
    {
      code: '1T',
      text: '深圳市天健（集团）股份有限公司'
    },
    {
      code: '1U',
      text: '深圳市振业（集团）股份有限公司'
    },
    {
      code: '1V',
      text: '深圳市特发集团有限公司'
    },
    {
      code: '1W',
      text: '深圳市远致投资有限公司'
    },
    {
      code: '1X',
      text: '深圳市东部公共交通有限公司'
    },
    {
      code: '1Y',
      text: '深圳市鲲鹏股权投资管理有限公司'
    },
    {
      code: '1Z',
      text: '深圳市重大产业投资集团有限公司'
    },
    {
      code: '11',
      text: '深圳市智慧城市科技发展集团有限公司'
    }
  ],
  other: [
    {
      code: '00',
      text: '中央企业'
    },
    {
      code: '10',
      text: '国家机关、事业单位和社会团体'
    },
    {
      code: '20',
      text: '深圳区属国企'
    },
    {
      code: '30',
      text: '集体企业'
    },
    {
      code: '40',
      text: '深圳市外地方国企'
    },
    {
      code: '50',
      text: '外资企业'
    },
    {
      code: '60',
      text: '民营企业'
    },
    {
      code: '70',
      text: '军队'
    },
    {
      code: '80',
      text: '其他'
    }
  ]
}
